validation/polydisperseBubbleFoam/shockTube/shockTube_500/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


coalescence off;

coalescenceKernel
{
    frequency CoulaloglouAndTavlarides;
    efficiency CoulaloglouAndTavlarides;
    laminarShearCoalescence off;
    continuousPhase air;

    Ca      Ca      [ 0 0 0 0 0 0 0 ]  0.88;
    Ceff    Ceff    [ 0 0 0 0 0 0 0 ]  6.0e9;
}

breakup off;

breakupKernel
{
    breakupKernel Alopaeus;

    Cb        Cb        [ 0 0 -1 0 0 0 0 ] 6.0;

    daughterDistribution
    {
        daughterDistribution uniform;
    }
}

odeCoeffs
{
    ATol    1.0e-10;
    RTol    1.0e-4;
    fac     0.9;
    facMin  0.5;
    facMax  2.0;
    minLocalDt 1.0e-7;
}

// ************************************************************************* //
